#pragma once
/**
 * Функція-генератор унікальних випадкових чисел від min_value, до max_value. При кожному визові - генерує нове випадкове число, 
 * яке ще не повторювалося.
 * 
 * Якщо передати min_value та max_value, такі, що min_value == max_value, то це приведе до сидання 
 * внутрішнього масиву станів.
 *
 * min_value == max_value == 0 видаляє внутрішній буфер станів. 
 *
 * Повертає:
 * значення в межах [min_value, max_value], 
 * 
 * min_value-1, якщо не можливо згенерувати унікальне значення, або у випадку зкидання внутрішнього масиву станів.
 */
int unique(int min_value, int max_value);

/**
 *  Заповнює масив унікальними значеннями. Послідовно, з початку масиву, використовуючи функцію unique().
 *
 *  Повертає кількість унікальних (що не поторюються) значень в масиві, остальні елементи, для яких не вдалося згенерувати 
 *  унікальне випадкове число - заповнюються значенням min_value - 1;
 */
int fills_with_unique(int array[], const size_t length, int min_value, int max_value);

